"use strict";
let lang=[
    {
        "1000":{
            day:"Արևային",
            night:"պարզ",
        }
    },
{
    "1003":{
        day:"Թեթև ամպամած",
        night:"թեթև ամպամած",
    }
},
{
    "1006":{
        day:"Ամպամած",
        night:"Ամպամած",
    }
},
{
    "1009":{
        day:"Ամպամած",
        night:"Ամպամած",
    }
},
{
    "1030":{
        day:"Մառախլապատ",
        night:"Մառախլապատ",
    }
},
{
    "1063":{
        day:"Տեղատարափ անձրև",
        night:"Տեղատարափ անձրև",
    }
},
{
    "1066":{
        day:"Տեղատարափ ձյուն",
        night:"Տեղատարափ ձյուն",
    }
},
{
    "1069":{
        day:"Ձնախառն անձրև",
        night:"Ձնախառն անձրև",
    }
},
{
    "1072":{
        day:"Ցրտաշունչ անձրև",
        night:"Ցրտաշունչ անձրև",
    }
},
{
    "1087":{
        day:"Ամպրոպի բռնկումներ",
        night:"Ամպրոպի բռնկումներ",
    }
},
{
    "1114":{
        day:"Ձյունամրրիկ",
        night:"Ձյունամրրիկ",
    }
},
{
    "1117":{
        day:"Ձնաբուք",
        night:"Ձնաբուք",
    }
},
{
    "1135":{
        day:"Մառախուղ",
        night:"Մառախուղ",
    }
},
{
    "1147":{
        day:"Սառցակալած մառախուղ",
        night:"Սառցակալած մառախուղ",
    }
},
{
    "1150":{
        day:"Կտրուկ թեթև անձրև",
        night:"Կտրուկ թեթև անձրև",
    }
},
{
    "1153":{
        day:"Թեթև անձրև",
        night:"Թեթև անձրև",
    }
},
{
    "1168":{
        day:"Սառը ցրտահարություն",
        night:"Սառը ցրտահարություն",
    }
},
{
    "1171":{
        day:"Թանձր Սառնամանիք",
        night:"Թանձր սառնամանիք",
    }
},
{
    "1180":{
        day:"Կտրուկ թեթև անձրև",
        night:"Կտրուկ թեթև անձրև",
    }
},
{
    "1183":{
        day:"Թեթև անձրև",
        night:"Թեթև անձրև",
    }
},
{
    "1186":{
        day:"Երբեմն՝ չափավոր անձրև",
        night:"Երբեմն՝ չափավոր անձրև",
    }
},
{
    "1189":{
        day:"Չափավոր անձրև",
        night:"Չափավոր անձրև",
    }
},
{
    "1192":{
        day:"Երբեմն` հորդառատ անձրև",
        night:"Երբեմն` հորդառատ անձրև",
    }
},
{
    "1195":{
        day:"Հորդառատ անձրև",
        night:"Հորդառատ անձրև",
    }
},
{
    "1198":{
        day:"Թեթև ցրտաշունչ անձրև",
        night:"Թեթև ցրտաշունչ անձրև",
    }
},
{
    "1201":{
        day:"Չափավոր կամ ուժեղ ցրտաշունչ անձրև",
        night:"Չափավոր կամ ուժեղ ցրտաշունչ անձրև",
    }
},
{
    "1204":{
        day:"Թեթև ձնախառն անձրև",
        night:"Թեթև ձնախառն անձրև",
    }
},
{
    "1207":{
        day:"Չափավոր կամ ուժեղ ձնախառն անձրև",
        night:"Չափավոր կամ ուժեղ ձնախառն անձրև",
    }
},
{
    "1210":{
        day:"Կտրուկ թույլ ձյուն",
        night:"Կտրուկ թույլ ձյուն",
    }
},
{
    "1213":{
        day:"Թեթև ձյուն",
        night:"Թեթև ձյուն",
    }
},
{
    "1216":{
        day:"Տեղատարափ չափավոր ձյուն",
        night:"Տեղատարափ չափավոր ձյուն",
    }
},
{
    "1219":{
        day:"Չափավոր ձյուն",
        night:"Չափավոր ձյուն",
    }
},
{
    "1222":{
        day:"Կտրուկ առատ ձյուն",
        night:"Կտրուկ առատ ձյուն",
    }
},
{
    "1225":{
        day:"Առատ ձյուն",
        night:"Առատ ձյուն",
    }
},
{
    "1237":{
        day:"Սառցե կարկուտ",
        night:"Սառցե կարկուտ",
    }
},
{
    "1240":{
        day:"Թեթև անձրևային տեղումներ",
        night:"Թեթև անձրևային տեղումներ",
    }
},
{
    "1243":{
        day:"Չափավոր կամ հորդառատ անձրևային տեղումներ",
        night:"Չափավոր կամ հորդառատ անձրևային տեղումներ",
    }
},
{
    "1246":{
        day:"Հորդառատ անձրև",
        night:"Հորդառատ անձրև",
    }
},
{
    "1249":{
        day:"Թեթև ձնախառն տեղումներ",
        night:"Թեթև ձնախառն տեղումներ",
    }
},
{
    "1252":{
        day:"Չափավոր կամ առատ ձնախառն տեղումներ",
        night:"Չափավոր կամ առատ ձնախառն տեղումներ",
    }
},
{
    "1255":{
        day:"Թույլ ձյան տեղումներ",
        night:"Թույլ ձյան տեղումներ",
    }
}, 
{
    "1258":{
        day:"Ձյան չափավոր կամ առատ տեղումներ",
        night:"Ձյան չափավոր կամ առատ տեղումներ",
    }
},
{
    "1261":{
        day:"Սառցե կարկուտի թեթև տեղումներ",
        night:"Սառցե կարկուտի թեթև տեղումներ",
    }
},
{
    "1264":{
        day:"Սառցե կարկուտի չափավոր կամ ուժեղ տեղումներ",
        night:"Սառցե կարկուտի չափավոր կամ ուժեղ տեղումներ",
    }
},
{
    "1273":{
        day:"Թույլ անձրև՝ ամպրոպ",
        night:"Թույլ անձրև՝ ամպրոպ",
    }
},
{
    "1276":{
        day:"Հորդառատ անձրև՝ ամպրոպ",
        night:"Հորդառատ անձրև՝ ամպրոպ",
    }
},
{
    "1279":{
        day:"Թեթև ձյուն՝ ամպրոպ",
        night:"Թեթև ձյուն՝ ամպրոպ",
    }
},
{
    "1282":{
        day:"Չափավոր կամ առատ ձյուն՝ ամպրոպ",
        night:"Չափավոր կամ առատ ձյուն՝ ամպրոպ",
    }
},

]
let apiKey="31204cfb77c049ae87a92619231204";
let card=document.querySelector(".card");
let form=document.querySelector(".form");
let input=document.querySelector(".input");
form.onsubmit=function(event){
    event.preventDefault();
    let cityInput=input.value;
let url=`http://api.weatherapi.com/v1/current.json?key=${apiKey}&q=${cityInput}`;
let text
fetch(url).then(function(response){
    return response.json()
}).then(function(city){
    if(city.error){
    card.innerHTML=city.error.message;
    }else{
    let codeLang=lang.find(function(item){
        return item[city.current.condition.code]
    })
    if(city.current.is_day=="0"){
        text=codeLang[city.current.condition.code].night
    }else{
        text=codeLang[city.current.condition.code].day
    }
    card.innerHTML=`
    <h1>${city.location.name}</h1>
    <h2>${city.location.country}</h2>
    <img class="img" src="http:${city.current.condition.icon}">
    <h3>${city.current.temp_c}</h3>
    <p>${text}</p>`
    }
})
}